In [1]:
from matplotlib import style
import numpy as np
import pandas as pd
import matplotlib as plt
import datetime as dt
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func
from sqlalchemy import inspect

In [2]:
engine = create_engine("sqlite:///hawaii.sqlite")

# reflect an existing database into a new model
Base = automap_base()
# reflect the tables
Base.prepare(engine, reflect=True)

# Save references to each table
Measurement = Base.classes.measurement
Station = Base.classes.station

In [3]:
Base.classes.keys()

['measurement', 'station']

In [4]:
# Create our session (link) from Python to the DB
session = Session(engine)

In [5]:
inspector = inspect(engine)
inspector.get_table_names()

['measurement', 'station']

In [6]:
columns = [column for column in inspector.get_columns('measurement')]
columns

[{'name': 'id',
  'type': INTEGER(),
  'nullable': False,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 1},
 {'name': 'station',
  'type': TEXT(),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'date',
  'type': TEXT(),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'prcp',
  'type': FLOAT(),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'tobs',
  'type': FLOAT(),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0}]

## D1: Determine the Summary Statistics for June

In [7]:
# Import the sqlalchemy extract function.
from sqlalchemy import extract

# 1. Write a query that filters the Measurement table to retrieve the temperatures for the month of June.

In [8]:
new_list = []
new_list = results = session.query(Measurement.date, Measurement.tobs).all()
date_df = pd.DataFrame(new_list)
date_df

             date  tobs
0      2010-01-01  65.0
1      2010-01-02  63.0
2      2010-01-03  74.0
3      2010-01-04  76.0
4      2010-01-06  73.0
...           ...   ...
19545  2017-08-19  71.0
19546  2017-08-20  78.0
19547  2017-08-21  76.0
19548  2017-08-22  76.0
19549  2017-08-23  76.0

[19550 rows x 2 columns]

In [9]:
Nlist = []
list1 = []
Nlist =  session.query(Measurement.date).all()
for date in Nlist:
    list1.append(date[0])

In [10]:
list2 = []
for date in list1:
    list2.append(date[5:])

In [11]:
date_df["mm-dd"] = list2
date_df

             date  tobs  mm-dd
0      2010-01-01  65.0  01-01
1      2010-01-02  63.0  01-02
2      2010-01-03  74.0  01-03
3      2010-01-04  76.0  01-04
4      2010-01-06  73.0  01-06
...           ...   ...    ...
19545  2017-08-19  71.0  08-19
19546  2017-08-20  78.0  08-20
19547  2017-08-21  76.0  08-21
19548  2017-08-22  76.0  08-22
19549  2017-08-23  76.0  08-23

[19550 rows x 3 columns]

In [20]:
june_df = date_df.loc[(date_df["mm-dd"] >= '06-01') & (date_df["mm-dd"] < '07-01') ]
june_df = june_df.rename({'tobs': 'June Temps'}, axis=1)
june_df

             date  June Temps  mm-dd
133    2010-06-01        78.0  06-01
134    2010-06-02        76.0  06-02
135    2010-06-03        78.0  06-03
136    2010-06-04        76.0  06-04
137    2010-06-05        77.0  06-05
...           ...         ...    ...
19492  2017-06-26        79.0  06-26
19493  2017-06-27        74.0  06-27
19494  2017-06-28        74.0  06-28
19495  2017-06-29        76.0  06-29
19496  2017-06-30        75.0  06-30

[1700 rows x 3 columns]

In [13]:
# 4. Calculate and print out the summary statistics for the June temperature DataFrame.
june_df.describe()

              tobs
count  1700.000000
mean     74.944118
std       3.257417
min      64.000000
25%      73.000000
50%      75.000000
75%      77.000000
max      85.000000

In [21]:
# 5. Return to your challenge instructions to compare your summary statistics
dec_df = date_df.loc[(date_df["mm-dd"] >= '12-01')]
dec_df = dec_df.rename({'tobs': 'December Temps'}, axis=1)

## D2: Determine the Summary Statistics for December

In [22]:
# 9. Calculate and print out the summary statistics for the Decemeber temperature DataFrame.
dec_df.describe()

       December Temps
count     1517.000000
mean        71.041529
std          3.745920
min         56.000000
25%         69.000000
50%         71.000000
75%         74.000000
max         83.000000

In [16]:
# 10. Return to your challenge instructions to compare your summary statistics